#!/usr/bin/env bash

# Иcпользуется адаптер CP2112
i2cdetect -l

# Обнаружить устройства на i2c шине
# -y не задавать лишних вопросов
# -r i2c устройство
# 8 - номер устройства i2c-8
i2cdetect -y -r 8

# Прочитать конкретные регистры
# -y не задавать лишних вопросов
# -r диапазон, читаем 0xFF регистр
# 8 - номер устройства i2c-8
i2cdump -y -r 0x0F-0x0F 8 0x19 b

# 0x19 -- lis3dh, то что в логерах
# 0x33 -- lis3dsh, нигде не используется

# Пример вывода работы скрипта
# ./scripts/read_who_am_i.sh
#      0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f
# 00:                         -- -- -- -- -- -- -- --
# 10: -- -- -- -- -- -- -- -- -- 19 -- -- -- -- -- --
# 20: -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
# 30: -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
# 40: -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
# 50: -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
# 60: -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
# 70: -- -- -- -- -- -- -- --
#      0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f    0123456789abcdef
# 00:                                              33                   3
